# RbsEnergyAnalysisExportComplexityParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisExportComplexityParam Property
ParameterTypeId Class See Also
---
"Export Complexity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisExportComplexityParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisExportComplexityParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisExportComplexityParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace